In [2]:
import pandas as pd

co2_gdp = pd.read_csv("co2.csv")
co2_gdp.head()

,iso_code,country,year,co2,consumption_co2,co2_growth_prct,co2_growth_abs,trade_co2,co2_per_capita,consumption_co2_per_capita,...,ghg_per_capita,methane,methane_per_capita,nitrous_oxide,nitrous_oxide_per_capita,population,gdp,primary_energy_consumption,energy_per_capita,energy_per_gdp
0,AFG,Afghanistan,1949,0.015,NaN,NaN,NaN,NaN,0.002,NaN,...,NaN,NaN,NaN,NaN,NaN,7624058.0,NaN,NaN,NaN,NaN
1,AFG,Afghanistan,1950,0.084,NaN,475.0,0.070,NaN,0.011,NaN,...,NaN,NaN,NaN,NaN,NaN,7752117.0,9.421400e+09,NaN,NaN,NaN
2,AFG,Afghanistan,1951,0.092,NaN,8.7,0.007,NaN,0.012,NaN,...,NaN,NaN,NaN,NaN,NaN,7840151.0,9.692280e+09,NaN,NaN,NaN
3,AFG,Afghanistan,1952,0.092,NaN,0.0,0.000,NaN,0.012,NaN,...,NaN,NaN,NaN,NaN,NaN,7935996.0,1.001732e+10,NaN,NaN,NaN
4,AFG,Afghanistan,1953,0.106,NaN,16.0,0.015,NaN,0.013,NaN,...,NaN,NaN,NaN,NaN,NaN,8039684.0,1.063052e+10,NaN,NaN,NaN

In [5]:
continent = pd.read_csv("country_data.csv")
continent.head()

,Continent_Name,Continent_Code,Country_Name,Two_Letter_Country_Code,Three_Letter_Country_Code,Country_Number
0,Asia,AS,"Afghanistan, Islamic Republic of",AF,AFG,4.0
1,Europe,EU,"Albania, Republic of",AL,ALB,8.0
2,Antarctica,AN,Antarctica (the territory South of 60 deg S),AQ,ATA,10.0
3,Africa,AF,"Algeria, People's Democratic Republic of",DZ,DZA,12.0
4,Oceania,OC,American Samoa,AS,ASM,16.0

In [3]:
temperature = pd.read_csv(".csv")
temperature.head()

  Continent_Name  Year           GDP  CO2 Emission  Temperature Change
0         Africa  1960  3.429277e+11     22.544665            0.546401
1         Africa  1961  3.413897e+11     22.959048            0.142466
2         Africa  1962  3.391227e+11     23.680187            0.050778
3         Africa  1963  3.444565e+11     21.063130            0.106403
4         Africa  1964  3.440042e+11     21.636742           -0.025159

In [6]:
continent_carbon_gdp = pd.merge(co2_gdp[["iso_code", "year", "co2", "gdp"]], continent[["Continent_Name", "Three_Letter_Country_Code"]], left_on="iso_code", right_on="Three_Letter_Country_Code", how="outer")

In [7]:
continent_carbon_gdp.head()

,iso_code,year,co2,gdp,Continent_Name,Three_Letter_Country_Code
0,AFG,1949.0,0.015,NaN,Asia,AFG
1,AFG,1950.0,0.084,9.421400e+09,Asia,AFG
2,AFG,1951.0,0.092,9.692280e+09,Asia,AFG
3,AFG,1952.0,0.092,1.001732e+10,Asia,AFG
4,AFG,1953.0,0.106,1.063052e+10,Asia,AFG

In [10]:
continent_carbon_gdp.drop("Three_Letter_Country_Code", axis=1, inplace=True)
continent_carbon_gdp.head()

  iso_code    year    co2           gdp Continent_Name
0      AFG  1949.0  0.015           NaN           Asia
1      AFG  1950.0  0.084  9.421400e+09           Asia
2      AFG  1951.0  0.092  9.692280e+09           Asia
3      AFG  1952.0  0.092  1.001732e+10           Asia
4      AFG  1953.0  0.106  1.063052e+10           Asia

In [15]:
continent_carbon_gdp_temperature = pd.merge(continent_carbon_gdp[continent_carbon_gdp.columns[1:]], temperature[["Continent_Name", "Temperature Change", "Year"]], left_on=["year", "Continent_Name"], right_on=["Year", "Continent_Name"], how="inner")
continent_carbon_gdp_temperature.head()

     year       co2           gdp Continent_Name  Temperature Change  Year
0  1960.0     0.414  1.303325e+10           Asia            0.538097  1960
1  1960.0   156.567           NaN           Asia            0.538097  1960
2  1960.0   156.567           NaN           Asia            0.538097  1960
3  1960.0   156.567           NaN           Asia            0.538097  1960
4  1960.0  1537.334           NaN           Asia            0.538097  1960

In [16]:
continent_carbon_gdp_temperature.drop("year", axis=1, inplace=True)

In [19]:
final_a = continent_carbon_gdp_temperature.drop("Temperature Change", axis=1).groupby(["Year", "Continent_Name"]).sum().reset_index()

In [20]:
final_a.head()

   Year Continent_Name        co2           gdp
0  1960         Africa    156.565  4.636984e+11
1  1960           Asia  56820.178  3.373661e+12
2  1960         Europe   4070.548  4.672395e+12
3  1960  North America   3179.469  3.803047e+12
4  1960        Oceania  18233.025  1.809751e+11

In [22]:
final_b = continent_carbon_gdp_temperature[continent_carbon_gdp_temperature.columns[2:]].groupby(["Year", "Continent_Name"]).mean().reset_index()
final_b.head()

   Year Continent_Name  Temperature Change
0  1960         Africa            0.546401
1  1960           Asia            0.538097
2  1960         Europe            0.828862
3  1960  North America            0.429086
4  1960        Oceania            0.348469

In [23]:
final = pd.merge(final_a, final_b, on=["Year", "Continent_Name"])

In [24]:
final.head()

   Year Continent_Name        co2           gdp  Temperature Change
0  1960         Africa    156.565  4.636984e+11            0.546401
1  1960           Asia  56820.178  3.373661e+12            0.538097
2  1960         Europe   4070.548  4.672395e+12            0.828862
3  1960  North America   3179.469  3.803047e+12            0.429086
4  1960        Oceania  18233.025  1.809751e+11            0.348469

In [29]:
final.rename(columns={"co2":"CO2 Emission", "gdp":"GDP"}, inplace = True)

In [30]:
final.to_csv("finalised_temp_gdp_co2.csv", index=False)